{"backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "implementation": 1, "dtype": "float32", "return_sequences": false, "recurrent_regularizer": null, "activation": "tanh", "batch_input_shape": [null, 200, 500], "use_bias": true, "trainable": true, "units": 300, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dropout": 0.0, "recurrent_constraint": null, "stateful": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "name": "lstm_4"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "activation": "linear", "units": 9, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_4", "noise_shape": null, "seed": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "softmax"}}]}